examples/02-zero-gradient-bnd/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

vertices
(
    (0 0 0)
    (1 0 0)  // pts 1-3 are not used to build the geometry, but placed here define (x,y,z) directions
    (1 1 0)  // pt 0 to 1 = x, 1 to 2 = y, 0 to 4 = z
    (0 1 0)
    (10 0 0)
    (0 0.9990482216 -0.0436193874)
    (0 0.9990482216 0.0436193874)
    (10 0.9990482216 -0.0436193874)
    (10 0.9990482216 0.0436193874)
);

blocks
(
    hex (0 5 6 0 4 7 8 4) (30 1 300) simpleGrading (0.1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 5 6 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 7 8 4)
        );
    }

    wall
    {
        type patch;
        faces
        (
            (5 6 8 7)
        );
    }

    axis
    {
        type empty;
        faces
        (
            (0 4 4 0)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 4 7 5)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 4 8 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //